# -*- coding: utf-8 -*-
"""
Created on Sat Nov 17 22:36:18 2018

@author: Mac
"""

keywords = {"food" : ["美团", "肯德基", "老盛昌", "全家", "水果", "汉堡王", "星巴克", "必胜客"],
            "traffic": ["嘀嗒", "嘀嘀", "美团"],
            "shopping": ["京东", ],
            "basic": ["城投水务", "电力公司"],
            "entertain":["幸福蓝海",],
            "raise child":["儿童医院", "第十人民医院", "网易考拉"],
            "life":["上蔬永辉"]
            }

def org(bill):
    """ bill是招行账单, 每一行是一条记录, 以\n分隔
        将按keywords中的关键字将bill有序分隔开 打印出来
    """
    entrys = [entry.strip() for entry in bill.split('\n') if len(entry) > 8]
    category = list(keywords.keys())
    sorted_bill = [[cat] for cat in category]
    remained_bill = ['remained']
    
    def get_money_amout(entry):
        """ 得到一条记录的金额
        """
        return int(entry[entry.rfind(' '):])
    
    
    def sort_entry(entry, category, keywords, extra_cond=True):
        """ 获得一条记录的分类
        """
        for (i, cat) in enumerate(category):
            for sub in keywords[cat]:
                if sub in entry:
                    return i
        else:
            return -1
    
    for each_entry in entrys:
        a = sort_entry(each_entry, category, keywords)
        if a == -1:
            remained_bill.append(each_entry)
        else:
            sorted_bill[a].append(each_entry)
    
    for cate in sorted_bill:
        if len(cate) > 1:
            print('\n',cate[0])
            for item in cate[1:]:
                print(item)

    print('\n',remained_bill[0])
    for item in remained_bill[1:]:
        print(item)
    
    
    print('\n\n\n\nreversed order:')
    for item in entrys[::-1]:
        print(item)

    return sorted_bill, remained_bill
    

if "__main__" == __name__:
    bill = """
1205 1206 财付通-京东商城平台商户 ￥ 109.82 7007 CN 109.82
1205 1206 支付宝-上海城投水务(集团)有限公 ￥ 277.60 7007 CN 277.60
1206 1207 财付通-上海市儿童医院 ￥ 15.50 7007 CN 15.50
1206 1207 财付通-美团点评 ￥ 91.79 7007 CN 91.79
1206 1207 财付通-上海市儿童医院 ￥ 89.00 7007 CN 89.00
1206 1207 财付通-上海市儿童医院 ￥ 64.00 7007 CN 64.00
1206 1207 财付通-美团点评 ￥ 14.00 7007 CN 14.00
1206 1207 财付通-彩贝壳 ￥ 39.90 7007 CN 39.90
1206 1207 财付通-美团点评 ￥ 12.00 7007 CN 12.00
1207 1208 财付通-美团点评 ￥ 27.74 7007 CN 27.74
1208 1209 财付通-美团点评 ￥ 14.00 7007 CN 14.00
1208 1209 财付通-微店店长 ￥ 2,900.00 7007 CN 2,900.00
1208 1209 财付通-美团点评 ￥ 33.50 7007 CN 33.50
1208 1209 财付通-北鼎BUYDEEM ￥ 49.70 7007 CN 49.70
1208 1209 支付宝-湖南奋飞壹佰网络科技有限公司 ￥ 216.00 7007 CN 216.00
1209 1210 财付通-猫眼/格瓦拉生活 ￥ 68.00 7007 CN 68.00
1209 1210 支付宝-国网上海市电力公司(缴费) ￥ 498.50 7007 CN 498.50
1211 1212 财付通-复旦大学附属华山医院 ￥ 35.00 7007 CN 35.00
1211 1212 财付通-复旦大学附属华山医院 ￥ 15.50 7007 CN 15.50
1211 1212 财付通-茗品汇上海正大乐城店 ￥ 80.00 7007 CN 80.00
1211 1212 财付通-复旦大学附属华山医院 ￥ 37.00 7007 CN 37.00
1211 1212 财付通-美团点评 ￥ 14.00 7007 CN 14.00
1211 1212 财付通-北鼎BUYDEEM ￥ 313.04 7007 CN 313.04
1211 1212 财付通-美团点评 ￥ 36.08 7007 CN 36.08
1212 1213 财付通-京东商城平台商户 ￥ 392.04 7007 CN 392.04
1212 1213 财付通-网易考拉海购 ￥ 199.00 7007 CN 199.00
1212 1213 财付通-网易考拉海购 ￥ 114.00 7007 CN 114.00
1212 1213 财付通-美团点评 ￥ 12.00 7007 CN 12.00
1213 1214 财付通-京东商城平台商户 ￥ 145.00 7007 CN 145.00
1213 1214 财付通-京东商城平台商户 ￥ 176.06 7007 CN 176.06
1213 1214 财付通-阿甘锅盔（新邻生活广 ￥ 17.00 7007 CN 17.00
1213 1214 财付通-上海多乐之日 ￥ 19.00 7007 CN 19.00
1213 1214 财付通-美团点评 ￥ 12.00 7007 CN 12.00
1213 1214 财付通-南区老大房（新邻生活 ￥ 31.60 7007 CN 31.60
1213 1214 财付通-美团点评 ￥ 13.00 7007 CN 13.00
1214 1215 财付通-美团点评 ￥ 119.50 7007 CN 119.50
1214 1215 财付通-复旦大学附属华山医院 ￥ 15.50 7007 CN 15.50
1214 1215 财付通-复旦大学附属华山医院 ￥ 25.00 7007 CN 25.00
1214 1215 财付通-复旦大学附属华山医院 ￥ 20.30 7007 CN 20.30
1214 1215 财付通-美团点评 ￥ 12.00 7007 CN 12.00
1215 1216 财付通-北鼎BUYDEEM ￥ 210.20 7007 CN 210.20
1215 1216 财付通-猫眼/格瓦拉生活 ￥ 68.00 7007 CN 68.00
1218 1219 财付通-韵秋荷 ￥ 207.89 7007 CN 207.89
1218 1219 财付通-美团点评 ￥ 12.00 7007 CN 12.00
1219 1220 财付通-全家familymart ￥ 22.80 7007 CN 22.80
1219 1220 财付通-美团点评 ￥ 79.00 7007 CN 79.00
1219 1220 保利物业发展股份宝山分公司保利叶语物业 ￥ 4,172.40 7007 CN 4,172.40
1219 1220 保利物业发展股份宝山分公司保利叶语物业 ￥ 3,600.00 7007 CN 3,600.00
1220 1221 财付通-京东商城平台商户 ￥ 65.00 7007 CN 65.00
1222 1223 财付通-大茉莉好物集 ￥ 258.00 7007 CN 258.00
1223 1224 财付通-万宁日用品商业（上海 ￥ 20.90 7007 CN 20.90
1223 1224 财付通-潮品挚尚 ￥ 14.90 7007 CN 14.90
1223 1224 财付通-玩具反斗城中国 ￥ 110.40 7007 CN 110.40
1223 1224 财付通-大茉莉好物集 ￥ 56.00 7007 CN 56.00
1223 1224 财付通-卡通尼乐园 ￥ 100.00 7007 CN 100.00
1223 1224 财付通-麦卡尤娜 ￥ 11.00 7007 CN 11.00
1224 1225 财付通-二维火智能收银 ￥ 49.00 7007 CN 49.00
1224 1225 财付通-焓胜嘉年华 ￥ 40.00 7007 CN 40.00
1224 1225 财付通-广州诺米品牌管理有限 ￥ 99.90 7007 CN 99.90
1224 1225 支付宝-李娟 ￥ 7.90 7007 CN 7.90
1225 1226 财付通-美团点评 ￥ 11.00 7007 CN 11.00
1225 1226 财付通-美团点评 ￥ 11.00 7007 CN 11.00
1226 1227 财付通-老盛昌 ￥ 9.90 7007 CN 9.90
1226 1227 财付通-大茉莉好物集 ￥ 66.00 7007 CN 66.00
1226 0103 财付通-大茉莉好物集 ￥- 66.00 7007 CN -66.00
1227 1228 财付通-美团点评 ￥ 14.00 7007 CN 14.00
1228 1229 财付通-嘀嗒出行 ￥ 44.20 7007 CN 44.20
1228 1229 财付通-美团点评 ￥ 11.00 7007 CN 11.00
1228 1229 财付通-嘀嗒出行 ￥ 39.10 7007 CN 39.10
1228 1229 财付通-上海宝山顾村公园管理 ￥ 20.00 7007 CN 20.00
1228 1229 财付通-微店 ￥ 76.00 7007 CN 76.00
1228 1229 财付通-鲍师傅糕点（五角场店 ￥ 69.20 7007 CN 69.20
1229 1230 财付通-美团点评 ￥ 14.00 7007 CN 14.00
1229 1230 财付通-百特喜鹅肝比萨意大利 ￥ 173.00 7007 CN 173.00
1229 1230 财付通-北京趣动旅程体育发展 ￥ 18,880.00 7007 CN 18,880.00
1230 1231 财付通-美团点评 ￥ 12.00 7007 CN 12.00
1231 0101 财付通-上海肯德基有限公司 ￥ 42.00 7007 CN 42.00
1231 0101 财付通-美团点评 ￥ 12.40 7007 CN 12.40
1231 0101 年费  300.00元 ￥ 0.00 7007 
1231 0101 刷卡   6次免年费  300.00元 ￥ 0.00 7007 
0101 0102 财付通-上海肯德基有限公司 ￥ 36.00 7007 CN 36.00
0101 0102 财付通-鲍师傅糕点（五角场店 ￥ 145.90 7007 CN 145.90
0101 0102 财付通-美团点评 ￥ 12.50 7007 CN 12.50
0102 0103 财付通-上海茱莉亚食品有限公 ￥ 38.00 7007 CN 38.00
0102 0103 财付通-上海市玛格萝妮昆山路 ￥ 68.94 7007 CN 68.94
0103 0104 财付通-鲜丰水果 ￥ 99.64 7007 CN 99.64
0103 0104 财付通-泉盛公司 ￥ 54.00 7007 CN 54.00
0103 0104 财付通-美团点评 ￥ 12.00 7007 CN 12.00
0103 0104 财付通-美团点评 ￥ 10.00 7007 CN 10.00
0103 0104 财付通-山林上海菊联路店 ￥ 32.70 7007 CN 32.70
    """
    
    org(bill)
    
        