# -*- coding: utf-8 -*-
"""
Created on Sun Mar 17 03:14:12 2019

@author: Mac
"""
import bill_checker as bc
import sys

if "__main__" == __name__:
    if len(sys.argv) == 1:
#        bill = """
#            0806 0807 财付通-京东商城平台商户 ￥ 888.00 7007 CN 888.00 
#            0808 0809 财付通-吴宝春麦方店 ￥ 155.00 7007 CN 155.00 
#            0808 0809 财付通-上海好德便利有限公司 ￥ 15.00 7007 CN 15.00 
#            0809 0810 财付通-京东商城平台商户 ￥ 190.00 7007 CN 190.00 
#        """
        
        bill = """
08/04 08/04 财付通-谷田稻香 94.70 4643
08/04 08/05 财付通-广东7-Eleven便利店 19.30 4643
08/04 08/05 财付通-丽途国际公寓(惠州十 654.00 4643
08/04 08/05 财付通-滴滴出行 151.76 4643
08/04 08/04 财付通-肯德基 45.00 4643
08/04 08/04 财付通-滴滴出行 70.91 4643
08/04 08/04 财付通-龙湖上海宝山天街 3.00 4643
08/04 08/04 财付通-谷田稻香 10.00 4643
08/05 08/05 财付通-广东7-Eleven便利店 6.00 4643
08/07 08/07 财付通-广东7-Eleven便利店 16.80 4643
08/07 08/07 财付通-广东7-Eleven便利店 10.00 4643
08/07 08/07 财付通-广东7-Eleven便利店 4.50 4643
08/07 08/07 财付通-丽途国际公寓(惠州十 436.00 4643
08/08 08/08 财付通-广东7-Eleven便利店 8.80 4643
08/08 08/09 财付通-广东7-Eleven便利店 39.50 4643
08/08 08/08 支付宝-国网上海市电力公司( 483.50 4643
08/08 08/08 财付通-全家FamilyMart 18.50 4643
08/08 08/08 财付通-广东7-Eleven便利店 6.00 4643
08/09 08/09 财付通-广东7-Eleven便利店 10.00 4643
08/09 08/09 财付通-广东7-Eleven便利店 8.80 4643
08/09 08/09 财付通-丽途国际公寓(惠州十 872.00 4643
08/10 08/10 财付通-滴滴出行 20.62 4643
08/10 08/10 财付通-广东7-Eleven便利店 8.80 4643
08/11 08/11 财付通-一本堂 18.00 4643
08/11 08/11 财付通-金亿餐饮 34.00 4643
08/11 08/12 财付通-广东7-Eleven便利店 44.00 4643
08/11 08/11 财付通-西汉南越王博物馆 12.00 4643
08/11 08/11 财付通-滴滴出行 17.42 4643
08/12 08/12 财付通-广东7-Eleven便利店 6.00 4643
08/13 08/14 财付通-广东7-Eleven便利店 14.00 4643
08/13 08/13 财付通-广东7-Eleven便利店 10.00 4643
08/13 08/13 财付通-广东7-Eleven便利店 5.00 4643
08/13 08/13 财付通-丽途国际公寓(惠州十 654.00 4643
08/14 08/14 财付通-广东7-Eleven便利店 8.80 4643
08/14 08/14 支付宝-相互宝分摊 1.47 4643
08/14 08/14 财付通-广东7-Eleven便利店 11.80 4643
08/14 08/14 支付宝-相互宝分摊 1.47 4643
08/15 08/15 财付通-广州亚惠美食有限公司 19.00 4643
08/15 08/15 财付通-东莞市家乐缘欧旺餐饮 8.00 4643
08/16 08/16 财付通-广东星巴克咖啡有限公 29.00 4643
08/16 08/16 财付通-广东7-Eleven便利店 11.80 4643
08/17 08/17 财付通-滴滴出行 101.35 4643
08/17 08/17 支付宝-周立珍 80.70 4643
08/17 08/17 财付通-京东商城平台商户 580.00 4643
08/20 08/20 支付宝-上海城投水务(集团)有 172.50 4643
08/20 08/21 支付宝-徐州迈仕电子商务有限 85.00 4643
08/20 08/21 财付通-上海双城石油化工 256.69 4643
08/23 08/23 财付通-上海亚惠博海餐饮有限 7.00 4643
08/23 08/23 财付通-上海麦金地集团股份有 10.00 4643
08/24 08/24 财付通-迈泊停车 3.00 4643
08/27 08/27 财付通-上海肯德基有限公司 36.50 4643
08/27 08/27 财付通-丽途国际公寓(惠州十 576.00 4643
08/28 08/28 支付宝-相互宝分摊 1.44 4643
08/28 08/28 财付通-广东7-Eleven便利店 10.50 4643
08/28 08/28 财付通-广东7-Eleven便利店 8.80 4643
08/28 08/28 支付宝-相互宝分摊 1.44 4643
08/29 08/29 财付通-广东7-Eleven便利店 8.50 4643
08/29 08/29 财付通-广东7-Eleven便利店 8.80 4643
08/29 08/30 财付通-羅氏百年雲吞广州绿地 13.50 4643
08/30 08/30 财付通-广东7-Eleven便利店 8.80 4643
08/30 08/30 财付通-广东7-Eleven便利店 11.50 4643
08/30 08/30 财付通-丽途国际公寓(惠州十 556.00 4643
08/30 08/30 财付通-手机充值 299.40 4643
08/30 08/30 财付通-手机充值 99.80 4643
08/31 08/31 财付通-广东7-Eleven便利店 8.00 4643
08/31 08/31 财付通-广东7-Eleven便利店 11.00 4643
08/31 08/31 财付通-广东星巴克咖啡有限公 29.00 4643
08/31 08/31 财付通-肯德基 26.00 4643
08/31 09/01 财付通-滴滴出行 81.20 4643
09/01 09/02 财付通-上海肯德基有限公司 19.50 4643
09/02 09/02 财付通-上海亚惠博海餐饮有限 20.00 4643
09/02 09/02 支付宝-唐义平 255.00 4643
09/02 09/02 财付通-上海市公安局 200.00 4643
09/02 09/02 财付通-上海亚惠博海餐饮有限 4.00 4643
09/02 09/02 财付通-上海优芙得餐饮管理有 18.20 4643
09/02 09/02 财付通-京东商城平台商户 149.00 4643

        """
        sorted_bill = bc.org(bill, print_reverse=0)
        bc.generate_xls(sorted_bill, 'test.xls')

    else:
        with open(sys.argv[1]) as f:
            bill_txt = f.read()
            bills = bc.org(bill_txt)
            bc.generate_xls(bills, sys.argv[2])
        
    
    
    
