# -*- coding: utf-8 -*-
"""
Created on Sun Mar 17 03:14:12 2019

@author: Mac
"""
import bill_checker as bc

if "__main__" == __name__:
    bill = """
0405 0406 财付通-美团点评平台商户 ￥ 30.50 7007 CN 30.50 
0406 0407 财付通-汉堡王（上海）餐饮有 ￥ 36.50 7007 CN 36.50 
0406 0407 财付通-京东商城平台商户 ￥ 41.00 7007 CN 41.00 
0407 0408 财付通-全家FamilyMart ￥ 11.40 7007 CN 11.40 
0407 0408 财付通-全家FamilyMart ￥ 6.00 7007 CN 6.00 
0407 0408 财付通-雪芙 ￥ 86.00 7007 CN 86.00 
0408 0409 财付通-文宝苑集贸市场蔬菜店 ￥ 23.00 7007 CN 23.00 
0408 0409 财付通-鲜丰水果 ￥ 114.06 7007 CN 114.06 
0409 0410 财付通-窝的鲜花 ￥ 49.00 7007 CN 49.00 
0410 0411 财付通-全家FamilyMart ￥ 24.00 7007 CN 24.00 
0410 0411 财付通-美团点评 ￥ 96.00 7007 CN 96.00 
0410 0411 财付通-美团点评 ￥ 12.40 7007 CN 12.40 
0410 0411 财付通-上海久光百货 ￥ 114.50 7007 CN 114.50 
0410 0411 财付通-上海久光百货 ￥ 52.80 7007 CN 52.80 
0411 0412 腾讯财付通 ￥ 2.00 7007 CN 2.00 
0411 0412 财付通-莉莲 ￥ 66.50 7007 CN 66.50 
0412 0413 财付通-老盛昌 ￥ 2.00 7007 CN 2.00 
0412 0413 财付通-全家FamilyMart ￥ 18.10 7007 CN 18.10 
0412 0413 财付通-卡通尼乐园 ￥ 100.00 7007 CN 100.00 
0412 0413 财付通-美团点评 ￥ 12.40 7007 CN 12.40 
0412 0413 财付通-美团点评 ￥ 9.00 7007 CN 9.00 
0413 0414 财付通-美团点评 ￥ 9.00 7007 CN 9.00 
0414 0415 财付通-煌上煌 ￥ 28.00 7007 CN 28.00 
0414 0415 财付通-陆祥店 ￥ 55.20 7007 CN 55.20 
0414 0415 财付通-陆祥店 ￥ 35.38 7007 CN 35.38 
0415 0416 财付通-全家FamilyMart ￥ 9.90 7007 CN 9.90 
0415 0416 财付通-京东商城平台商户 ￥ 83.90 7007 CN 83.90 
0415 0416 财付通-上海宝山顾村公园管理 ￥ 20.00 7007 CN 20.00 
0416 0417 财付通-老盛昌 ￥ 5.00 7007 CN 5.00 
0416 0417 财付通-全家FamilyMart ￥ 34.90 7007 CN 34.90 
0416 0417 财付通-美团点评 ￥ 12.50 7007 CN 12.50 
0417 0418 财付通-美团点评平台商户 ￥ 34.60 7007 CN 34.60 
0417 0418 财付通-优衣库 ￥ 447.00 7007 CN 447.00 
0417 0418 财付通-Tea Opal 茶阁里的猫 ￥ 123.00 7007 CN 123.00 
0417 0418 财付通-上海多乐之日 ￥ 23.80 7007 CN 23.80 
0418 0419 财付通-美团点评 ￥ 12.10 7007 CN 12.10 
0418 0419 财付通-上海金拱门食品有限公 ￥ 19.00 7007 CN 19.00 
0418 0419 财付通-美团点评 ￥ 12.50 7007 CN 12.50 
0418 0419 财付通-广州诺米品牌管理有限 ￥ 69.90 7007 CN 69.90 
0418 0419 财付通-联华超市 ￥ 16.00 7007 CN 16.00 
0418 0419 财付通-全家FamilyMart ￥ 42.00 7007 CN 42.00 
0419 0420 财付通-老盛昌 ￥ 19.00 7007 CN 19.00 
0419 0420 财付通-美团点评 ￥ 13.11 7007 CN 13.11 
0419 0420 财付通-美团点评 ￥ 12.50 7007 CN 12.50 
0419 0420 上海市otto2艺术美学宝山龙湖天街店 ￥ 3,710.00 7007 CN 3,710.00 
0419 0420 财付通-平安银行特约商户 ￥ 99.00 7007 CN 99.00 
0420 0421 财付通-美团点评 ￥ 259.00 7007 CN 259.00 
0420 0421 财付通-京东商城平台商户 ￥ 159.00 7007 CN 159.00 
0421 0422 财付通-Mo-Mo牧场（陕南牧场 ￥ 336.00 7007 CN 336.00 
0422 0423 财付通-京东商城平台商户 ￥ 110.60 7007 CN 110.60 
0422 0423 财付通-老盛昌 ￥ 15.00 7007 CN 15.00 
0422 0423 财付通-京东商城平台商户 ￥ 167.70 7007 CN 167.70 
0422 0423 财付通-京东商城平台商户 ￥ 112.30 7007 CN 112.30 
0423 0424 财付通-美团点评 ￥ 13.00 7007 CN 13.00 
0423 0424 财付通-文宝苑集贸市场蔬菜店 ￥ 23.50 7007 CN 23.50 
0423 0424 财付通-阿文大虾 ￥ 68.00 7007 CN 68.00 
0423 0424 财付通-万物心选 ￥ 69.00 7007 CN 69.00 
0423 0424 财付通-全家FamilyMart ￥ 12.00 7007 CN 12.00 
0424 0425 财付通-幸福蓝海国际影城 ￥ 200.00 7007 CN 200.00 
0424 0425 财付通-上海多乐之日 ￥ 24.50 7007 CN 24.50 
0424 0425 财付通-Tea Opal 茶阁里的猫 ￥ 24.00 7007 CN 24.00 
0424 0425 财付通-美团点评 ￥ 12.20 7007 CN 12.20 
0424 0425 财付通-泉盛公司 ￥ 80.00 7007 CN 80.00 
0424 0425 财付通-美团点评 ￥ 12.50 7007 CN 12.50 
0425 0426 腾讯财付通 ￥ 12.50 7007 CN 12.50 
0425 0426 财付通-复旦大学附属华山医院 ￥ 5.80 7007 CN 5.80 
0425 0426 财付通-上海肯德基有限公司 ￥ 8.00 7007 CN 8.00 
0425 0426 财付通 ￥ 39.90 7007 CN 39.90 
0425 0426 财付通-上海肯德基有限公司 ￥ 16.00 7007 CN 16.00 
0425 0426 财付通-复旦大学附属华山医院 ￥ 6.00 7007 CN 6.00 
0426 0427 财付通-美团点评 ￥ 13.86 7007 CN 13.86 
0426 0427 财付通-HM ￥ 149.00 7007 CN 149.00 
0426 0427 财付通-美团点评 ￥ 13.86 7007 CN 13.86 
0426 0427 财付通 ￥ 131.00 7007 CN 131.00 
0426 0427 财付通-HM ￥ 79.90 7007 CN 79.90 
0427 0428 财付通-汉堡王（上海）餐饮有 ￥ 15.50 7007 CN 15.50 
0428 0429 财付通-龙湖上海宝山天街 ￥ 5.00 7007 CN 5.00 
0428 0429 财付通-美团点评平台商户 ￥ 13.86 7007 CN 13.86 
0428 0429 财付通-上海金拱门食品有限公 ￥ 30.50 7007 CN 30.50 
0428 0429 财付通-麦卡尤娜 ￥ 17.00 7007 CN 17.00 
0429 0430 ETCP ￥ 14.88 7007 CN 14.88 
0429 0430 财付通-当当网 ￥ 67.80 7007 CN 67.80 
0429 0430 财付通-京东商城平台商户 ￥ 140.61 7007 CN 140.61 
0430 0501 财付通-京东商城平台商户 ￥ 71.00 7007 CN 71.00 
0430 0501 财付通-全家FamilyMart ￥ 91.70 7007 CN 91.70 
0501 0502 财付通-美团点评平台商户 ￥ 13.86 7007 CN 13.86 
0502 0503 财付通-上海城开（集团）无锡 ￥ 672.00 7007 CN 672.00 
0503 0504 财付通-肯德基 ￥ 37.50 7007 CN 37.50 
0503 0504 财付通-迪亚天天 ￥ 10.80 7007 CN 10.80 
0503 0504 财付通-肯德基 ￥ 7.50 7007 CN 7.50 
0503 0504 财付通-肯德基 ￥ 47.00 7007 CN 47.00




    """
    
    bc.org(bill, print_reverse=1)
    